---
kind: type
id: T:Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity
source: html/d31b6d5f-f002-007b-3e08-e6818727f104.htm
---
# Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity

This class encapsulates initial illuminance intensity calculation.

## Syntax (C#)
```csharp
public class InitialIlluminanceIntensity : InitialIntensity
```